<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
	<TITLE>XJ Sync = Ordnerabgleich f&uuml;r Mac/Linux/Windows</TITLE>
	<META NAME="GENERATOR" CONTENT="StarOffice/5.1 (Win32)">
	<META NAME="CREATED" CONTENT="20090704;13535131">
	<META NAME="CHANGEDBY" CONTENT="Martin G&auml;ckler">
	<META NAME="CHANGED" CONTENT="20090704;13574204">
	<STYLE>
	<!--
		H3 { color: #000000 }
		H2 { color: #000000 }
		TD P { color: #000000 }
		H1 { color: #000000 }
		P { color: #000000 }
		A:visited { color: #990099 }
		A:link { color: #000099 }
	-->
	</STYLE>
</HEAD>
<BODY TEXT="#000000" LINK="#000099" VLINK="#990099" BGCOLOR="#00ff00">
<H1 ALIGN=CENTER>XJ Sync = Ordnerabgleich f&uuml;r Mac/Linux/Windows</H1>
<P ALIGN=CENTER>(c) 2003-2009 by CRESD GmbH</P>
<P ALIGN=CENTER><A HREF="http://www.cresd.de/">http://www.cresd.de</A></P>
<H2>Einleitung</H2>
<P>Mit Hilfe dieses Programmes k&ouml;nnen Sie zwei Ordner z.B. auf
einem Notebook und einer Arbeitsstation abgleichen. Getestet und
entwickelt wurde diese Anwendung unter Mac OS X 10.4, SuSe Linux
10.1, Kubuntu 6.06, Windows XP und Windows 2000.</P>
<P>Unter Linux und Windows m&uuml;ssen Sie die Sun Java
Laufzeitumgebung in der Version 1.4.x oder neuer installiert haben.
Achten Sie auch darauf, da&szlig; die Javaumgebung in Ihrer
Pfadvariable eingetragen ist. Mac OS X bringt automatisch eine solche
mit.</P>
<H2>Starten</H2>
<P>Zum Starten des Programmes gehen Sie wie folgt vor:</P>
<H3>Mac OS X Finder:</H3>
<P>Starten Sie das Programm wie gewohnt durch Doppelklick auf das
Symbol f&uuml;r &quot;XJ Sync&quot;.</P>
<H3>Darwin/Linux:</H3>
<P>Wechseln Sie in das Verzeichnis &quot;XJ Sync.app&quot; und
starten Sie das Shellscript xjsync. M&ouml;glicherweise m&uuml;ssen
Sie mit dem Kommando</P>
<P ALIGN=CENTER>chmod +x xjsync</P>
<P>das Skript ausf&uuml;hrbar machen.</P>
<H3>Windows:</H3>
<P>&Ouml;ffnen Sie das Verzeichnis &quot;XJ Sync.app&quot; und
starten Sie von dort das Shellscript xjsync.bat. Im Verzeichnis XJ
Sync.app\Contents\Windows gibt es auch eine ausf&uuml;hrbare Datei
xjsync.exe, die sofern Sie &uuml;ber die entsprechenden Rechte
verf&uuml;gen, eine Verkn&uuml;pfung zu den Datenbankdateien von XJ
Sync herstellen kann.</P>
<H2>Anwendung</H2>
<P>Die Anwendung dieses Programmes sollte eigentlich sehr einfach
sein, weshalb hier nur kurz darauf eingegangen werden soll:</P>
<P>Zum Erstellen einer neuen Datenbank w&auml;hlen Sie zwei
Verzeichnisse aus, die abgeglichen werden sollen. Anschlie&szlig;end
werden diese sofort verglichen und das Ergebnis angezeigt. Nun k&ouml;nnen
Sie noch w&auml;hlen auf welche Art und Weise die beiden
Verzeichnisse abgeglichen werden sollen. Dabei haben Sie die Wahl
zwischen &quot;Beide Seiten&quot;, &quot;Von Links nach Rechts&quot;
und von &quot;Rechts nach Links&quot; aus dem Men&uuml;
&quot;Quelle/Ziel&quot;.</P>
<P>Im Men&uuml; Operation k&ouml;nnen Sie f&uuml;r ausgew&auml;hlte
Dateien die berechnete Operation selbst vergeben. Dar&uuml;ber hinaus
k&ouml;nnen Sie dort einen oder mehrere durch Strichpunkt getrennte
Filter festlegen, mit denen bestimmte Dateien ausgeblendet werden
sollen.<BR>Beispiel: *.obj;*.csm;*.class</P>
<P>Nach dem Klick auf das Diskettensymbol wird die Datenbank
gespeichert und kann jederzeit wieder geladen werden indem Sie den
Schalter &quot;&Ouml;ffnen...&quot; dr&uuml;cken. Schlie&szlig;lich
wird mit dem Symbol f&uuml;r die Synchronisation der Abgleich
gestartet.</P>
</BODY>
</HTML>
